{"translation-revision-date":"2021-05-27 17:46:24+0000","generator":"GlotPress\/3.0.0-alpha.2","domain":"messages","locale_data":{"messages":{"":{"domain":"messages","plural-forms":"nplurals=3; plural=(n % 10 == 1 && n % 100 != 11) ? 0 : ((n % 10 >= 2 && n % 10 <= 4 && (n % 100 < 12 || n % 100 > 14)) ? 1 : 2);","lang":"ru"},"It appears that your server is running on nginx, so the fix will most likely require adding the correct rewrite rules to our nginx configuration. %1$sCheck our documentation for more information%2$s.":["Похоже, ваш сервер работает на Nginx, поэтому для исправления, вероятно, потребуется добавить корректные правила перезаписи в конфигурацию Nginx. %1$sВзгляните на нашу документацию для получения дополнительной информации%2$s."],"It appears that your server is running on Apache, so the fix should be as simple as checking the %1$scorrect .htaccess implementation on wordpress.org%2$s.":["Похоже, ваш сервер работает на Apache, поэтому для исправления достаточно просто проверить %1$sкорректность формирования .htaccess на wordpress.org%2$s."],"It looks like you are missing the proper rewrite rules for the robots.txt file.":["Похоже, файлу robots.txt не назначены подходящие правила перезаписи."],"This site is running in a sub-directory of your main site located at %1$s. Your robots.txt file should only appear in the root directory of that site.":["Этот сайт работает в подкаталоге вашего основного сайта, расположенном в %1$s. Ваш файл robots.txt должен появляться только в корневом каталоге этого сайта."],"Import and Delete":["Импорт и удаление"],"%1$s has detected a physical robots.txt file in the root folder of your WordPress installation. We recommend removing this file as it could cause conflicts with WordPress' dynamically generated one. %2$s can import this file and delete it, or you can simply delete it.":["%1$s обнаружил физический файл robots.txt в корневой папке WordPress. Рекомендуется удалить этот файл, так как он может вызвать конфликт с динамически созданным файлом. %2$s может импортировать данные этого файла и дезинтегрировать его, или вы можете просто удалить его."],"Open Robots.txt":["Открыть robots.txt"],"Robots.txt Preview:":["Предпросмотр robots.txt:"],"Delete Rule":["Удалить правило"],"Duplicate or invalid entries have been detected! Please check your rules and try again.":["Обнаружены повторяющиеся или недействительные записи! Проверьте установленные правила и попробуйте снова."],"Enable Custom Robots.txt":["Включить произвольный robots.txt"],"Just like WordPress, %1$s generates a dynamic file so there is no static file to be found on your server.  The content of the robots.txt file is stored in your WordPress database.":["Как и WordPress, %1$s создаёт динамический виртуальный robots.txt, поэтому на вашем сервере не хранится отдельный физический файл. Содержимое robots.txt хранится в базе данных сайта."],"The robots.txt editor in %1$s allows you to set up a robots.txt file for your site that will override the default robots.txt file that WordPress creates. By creating a robots.txt file with %2$s you have greater control over the instructions you give web crawlers about your site.":["Редактор robots.txt в %1$s позволяет настраивать robots.txt сайта, который заменит стандартный robots.txt WordPress. Создавая файл robots.txt при помощи %2$s, вы получаете больший контроль над инструкциями, которые даются поисковым роботам относительно вашего сайта."],"Delete":["Удалить"],"Disallow":["Запретить"],"Allow":["Разрешить"],"Rule":["Правило"],"Add Rule":["Добавить правило"],"Directory Path":["Путь к каталогу"],"User Agent":["User Agent"],"Robots.txt Editor":["Редактор robots.txt"]}},"comment":{"reference":"dist\/Lite\/assets\/js\/tools-RobotsEditor-vue.js"}}